#  ['a','a', 'c'] -------------------------------------------- Список
# {'key0' : 'value', 'key1' : 'value1' , 'key2' : 'value2 ]----------------- Словник
# {'a', 'b', 'c'} --------------------------------------------- Множина
# ( )----------------- Кортеж
#
from turtle import clear

#-----------------------------------------Створюємо множину Вар 1
some_set = {'a', 'b', 'c', 'd', 'c'}
print(some_set) #------------------------- Елементи лише унікальні
print('----------------------------------------')

#-----------------------------------------Створюємо множину Вар 2
some_set_two = set([1,2,3,4,5])
print(some_set_two)
print('------------------------------------------')
#----------------------------------------------------------------
some_set_three = set('develuper')
print(some_set_three)# ---------------------будуть відібрані тільки інікальні значення та впорядковані
list = list('develuper')
print(list)
print('-----------------------------------')
#-------------------------------------- Визначаємо довжину множини len()
some_set_four = set('devops')
print(some_set_four)
print(len(some_set_four))
print('----------------------------------')

# -------------------------------------- перевіряємо наявність символа в середині нашої колекції
some_set_six = set('internet')
print(some_set_six)
print('w' in some_set_six)
print('i' in some_set_six)
print('-----------------------------------')
#---------------------------------------- Методи множин
# print(help(set)) # ------------------------------------------Перелік методів множин

#-------------------------------------------------незмінна множина Frozenset
some_frozen_set = frozenset('internet')
# print(some_frozen_set)
print('-----------------------------------')

# print(dir(some_frozen_set))
print('-----------------------------------------')
#-------------------------------------------------- очищаємо множину
print(some_set_six)
some_set_six.clear()
print(some_set_six)
print('------------------------------------------')
#---------------------------------------------------- видаляємо один (випадковий) елемент множини pop()
print(some_set_four)
some_set_four.pop()
print(some_set_four)
print('-------------------------------------------')
#----------------------------------------------------- видаляємо один (конкретний) елемент з множини discard()
#----------------------------------------------------- але не отримуємо помилки, якщо елементу немає у множині
print(some_set_four)
some_set_four.discard('e')
print(some_set_four)
some_set_four.discard('p')
print(some_set_four)
print('--------------------------------------------')
#----------------------------------------------------- видаляємо один (конкретний) елемент з множини remove()
#----------------------------------------------------- та отримуємо помилки, якщо елементу немає у множині
print(some_set_four)
some_set_four.remove('s')
print(some_set_four)
print('--------------------------------------------')
# some_set_four.remove('z')
print(some_set_four)
print('--------------------------------------------')
#-------------------------------------------------- додаємо елемент у множину на випадкову позицію add()
print(some_set_four)
some_set_four.add('z')
print(some_set_four)
some_set_four.add('w')
print(some_set_four)
print('---------------------------------------------')
#-------------------------------------------------


